InformationRegisters/СогласияНаУведомленияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СогласияНаУведомленияОбЭЛН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтзываСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласиеНаУведомлениеОбЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласийНаУведомленияОбЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеОтзываСогласия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеОтзываСогласия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодпискиНаУведомленияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПодпискиНаУведомленияОбЭЛН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БудетДействовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласийНаУведомленияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СостоянияСогласийНаУведомленияОбЭЛН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписания</Name>
					<Comment>Нет действующего согласия, есть непроведенное согласие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписано</Name>
					<Comment>Есть действующее согласие, нет отзыва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
					<Comment>Есть действующее согласие и есть его отзыв</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПланируетсяПодписывать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СогласиеНаУведомлениеОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>СогласиеНаУведомлениеОбЭЛН</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСтрахователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдресСтрахователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИООтветственногоЗаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПодписалСогласие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СогласияНаУведомленияОбЭЛН/Forms/ИзменениеСоставаПодписок/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ВключитьПодписку Тогда
		Элементы.Список.Заголовок = НСтр("ru = 'Сотрудники, для которых требуется включить подписку на уведомления об изменении состояний ЭЛН'");
		Элементы.Подтверждаю.Видимость = Истина;
		Элементы.ФормаИзменитьПодписку.Доступность = Ложь;
		Элементы.ФормаИзменитьПодписку.КнопкаПоУмолчанию = Ложь;
	Иначе
		Элементы.Список.Заголовок = НСтр("ru = 'Сотрудники, для которых требуется отключить подписку на уведомления об изменении состояний ЭЛН'");
		Подтверждаю = Истина;
		Элементы.Подтверждаю.Видимость = Ложь;
		Элементы.ФормаИзменитьПодписку.Доступность = Истина;
		Элементы.ФормаИзменитьПодписку.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект, "СписокСтраховойНомерПФР");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Текст", НСтр("ru = '<Не заполнен>'"));
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Список.СтраховойНомерПФР", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект, "СписокИндексКартинки, СписокКратко");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Видимость", Ложь);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Отображать", Ложь);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Список.ПоказыватьРезультат", "=", Ложь);
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект, "СписокИспользование");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Видимость", Ложь);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Отображать", Ложь);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Доступность", Ложь);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Список.ПоказыватьРезультат", "=", Истина);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Список.Использование", "=", Ложь);
	
	ЗаполнитьСписок("ПриСозданииНаСервере");
	
	Если Параметры.ВключитьПодписку Тогда
		Если Список.Количество() > 1 Тогда
			Заголовок = НСтр("ru = 'Включение подписок на уведомления об изменении состояний ЭЛН в ФСС'");
			Элементы.ФормаИзменитьПодписку.Заголовок = НСтр("ru = 'Включить подписки'");
		Иначе
			Заголовок = НСтр("ru = 'Включение подписки на уведомления об изменении состояний ЭЛН в ФСС'");
			Элементы.ФормаИзменитьПодписку.Заголовок = НСтр("ru = 'Включить подписку'");
		КонецЕсли;
	Иначе
		Если Список.Количество() > 1 Тогда
			Заголовок = НСтр("ru = 'Отключение подписок на уведомления об изменении состояний ЭЛН в ФСС'");
			Элементы.ФормаИзменитьПодписку.Заголовок = НСтр("ru = 'Отключить подписку'");
		Иначе
			Заголовок = НСтр("ru = 'Отключение подписки на уведомления об изменении состояний ЭЛН в ФСС'");
			Элементы.ФормаИзменитьПодписку.Заголовок = НСтр("ru = 'Отключить подписки'");
		КонецЕсли;
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = 
		Формат(Элементы.Подтверждаю.Видимость, "БЛ=0; БИ=1")
		+ Формат(Элементы.Страхователь.Видимость, "БЛ=0; БИ=1");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Параметры.ВключитьПодписку И Параметры.ЗаполнитьПоДаннымУчета И Список.Количество() = 0 Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Отключать подписки на ЭЛН не требуется'"), , , БиблиотекаКартинок.Информация32);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_СогласиеНаУведомлениеОбЭЛН"
		Или ИмяСобытия = "Запись_ОтзывСогласияНаУведомлениеОбЭЛН"
		Или ИмяСобытия = "Запись_Увольнение"
		Или ИмяСобытия = "Запись_УвольнениеСписком"
		Или ИмяСобытия = "Запись_ФизическиеЛица"
		Или ИмяСобытия = "Запись_Сотрудники" Тогда
		ОтключитьОбработчикОжидания("ЗаполнитьСписокНаКлиенте");
		ПодключитьОбработчикОжидания("ЗаполнитьСписокНаКлиенте", 0.1, Истина);
	ИначеЕсли ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС() Тогда
		ПроверитьНаличиеОтветовОтФСС();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодтверждаюПриИзменении(Элемент)
	Элементы.ФормаИзменитьПодписку.Доступность = Подтверждаю;
	Элементы.ФормаИзменитьПодписку.КнопкаПоУмолчанию = Подтверждаю;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(ТаблицаФормы, ИдентификаторСтроки, ПолеФормы, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлементСписка = ТаблицаФормы.ДанныеСтроки(ИдентификаторСтроки);
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ПолеФормы = Элементы.СписокСтраховойНомерПФР Тогда
		ПоказатьЗначение(, ЭлементСписка.ФизическоеЛицо);
	ИначеЕсли ПолеФормы = Элементы.СписокСогласие Тогда
		Если ЗначениеЗаполнено(ЭлементСписка.Согласие) Тогда
			СЭДОФССРасширенныйКлиент.ОткрытьСогласие(ЭлементСписка.Согласие);
		КонецЕсли;
	ИначеЕсли ПолеФормы = Элементы.СписокДатаОтзываСогласия
		Или ПолеФормы = Элементы.СписокОснованиеОтзываСогласия Тогда
		Если ЗначениеЗаполнено(ЭлементСписка.ОснованиеОтзываСогласия) Тогда
			ПоказатьЗначение(, ЭлементСписка.ОснованиеОтзываСогласия);
		КонецЕсли;
	ИначеЕсли ПолеФормы = Элементы.СписокКратко
		Или ПолеФормы = Элементы.СписокИндексКартинки Тогда
		Если ЭлементСписка.Подробно = "{ОткрытьСогласие}" Тогда
			СЭДОФССРасширенныйКлиент.ОткрытьСогласие(ЭлементСписка.Согласие, ЭлементСписка.Страхователь, ЭлементСписка.ФизическоеЛицо);
		Иначе
			Если ЭлементСписка.ИндексКартинки = 5 Тогда
				ЗаголовокТекста = НСтр("ru = 'Подробная информация об ошибке'");
				Картинка = БиблиотекаКартинок.Предупреждение32;
			Иначе
				ЗаголовокТекста = НСтр("ru = 'Подробная информация'");
				Картинка = БиблиотекаКартинок.Успешно32;
			КонецЕсли;
			Текст = ?(ЗначениеЗаполнено(ЭлементСписка.Подробно), ЭлементСписка.Подробно, ЭлементСписка.Кратко);
			ИнформированиеПользователяКлиент.ПоказатьПодробности(Текст, ЗаголовокТекста, Картинка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВсе(Команда)
	Для Каждого ЭлементСписка Из Список Цикл
		Если ЭлементСписка.ПоказыватьРезультат Тогда
			Продолжить;
		КонецЕсли;
		ЭлементСписка.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсе(Команда)
	Для Каждого ЭлементСписка Из Список Цикл
		ЭлементСписка.Использование = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПодписку(Команда)
	Если Не Подтверждаю Тогда
		ТекстОшибки = НСтр("ru = 'Требуется подтверждение'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Подтверждаю");
		Возврат;
	КонецЕсли;
	
	// Дата отправки для пользователя - момент нажатия на кнопку.
	ДатаОтправки = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Контекст = Новый Структура("Организации", Новый Массив);
	
	ОрганизацииИСНИЛС = Новый Соответствие;
	ОтправляемыеСтроки = Список.НайтиСтроки(Новый Структура("Использование, ЗапросОтправлен", Истина, Ложь));
	Для Каждого ЭлементСписка Из ОтправляемыеСтроки Цикл
		СНИЛС = ОрганизацииИСНИЛС[ЭлементСписка.Страхователь];
		Если СНИЛС = Неопределено Тогда
			СНИЛС = Новый Массив;
			ОрганизацииИСНИЛС.Вставить(ЭлементСписка.Страхователь, СНИЛС);
			Контекст.Организации.Добавить(ЭлементСписка.Страхователь);
		КонецЕсли;
		СНИЛС.Добавить(УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеФСС(ЭлементСписка.СтраховойНомерПФР));
		ЭлементСписка.ЗапросОтправлен = Истина;
		ЭлементСписка.ПоказыватьРезультат = Истина;
	КонецЦикла;
	
	Обработчик = Новый ОписаниеОповещения("ПослеОтправкиЗапросовВФСС", ЭтотОбъект, Контекст);
	Если Параметры.ВключитьПодписку Тогда
		ЭлектронныйДокументооборотСФССКлиент.ПодписатьСотрудниковОрганизацийНаУведомленияПоЭЛН(Обработчик, ОрганизацииИСНИЛС);
	Иначе
		ЭлектронныйДокументооборотСФССКлиент.ОтписатьСотрудниковОрганизацийОтУведомленийПоЭЛН(Обработчик, ОрганизацииИСНИЛС);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСписокНаКлиенте()
	ЗаполнитьСписок("ЗаполнитьСписокНаКлиенте");
	Отказ = Ложь;
	ПриОткрытии(Отказ);
	Если Отказ И Открыта() Тогда
		Закрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок(ИмяСобытия)
	Если Параметры.ЗаполнитьПоДаннымУчета Тогда
		
		Если Параметры.ВключитьПодписку Тогда
			Требования = РегистрыСведений.СогласияНаУведомленияОбЭЛН.ТребованияПоВключениюПодписокНаЭЛН();
		Иначе
			Требования = РегистрыСведений.СогласияНаУведомленияОбЭЛН.ТребованияПоОтключениюПодписокНаЭЛН();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПриСозданииНаСервере" Тогда
		МассивОснований = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "МассивОснований");
		
		Если ТипЗнч(МассивОснований) = Тип("СправочникСсылка.Сотрудники")
			Или ТипЗнч(МассивОснований[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
			
			Если ТипЗнч(МассивОснований) = Тип("СправочникСсылка.Сотрудники") Тогда
				МассивСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивОснований);
			Иначе
				МассивСотрудников = МассивОснований;
			КонецЕсли;
			КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников, "Организация, ФизическоеЛицо");
			
			Требования = КадровыеДанные.Скопировать();
			СЭДОФСС.ЗаполнитьСтрахователяВТаблицеЗначений(Требования);
			
		ИначеЕсли ТипЗнч(МассивОснований[0]) = Тип("ДокументСсылка.СогласиеНаУведомлениеОбЭЛН") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СогласиеНаУведомлениеОбЭЛН.Страхователь КАК Страхователь,
			|	СогласиеНаУведомлениеОбЭЛН.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	Документ.СогласиеНаУведомлениеОбЭЛН КАК СогласиеНаУведомлениеОбЭЛН
			|ГДЕ
			|	СогласиеНаУведомлениеОбЭЛН.Ссылка В(&МассивОснований)";
			Запрос.УстановитьПараметр("МассивОснований", МассивОснований);
			Требования = Запрос.Выполнить().Выгрузить();
			
		Иначе
			
			Требования = Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		Требования = Список.Выгрузить().Скопировать(, "Страхователь, ФизическоеЛицо");
		
	КонецЕсли;
	
	Если Требования = Неопределено Или Требования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Требования.Страхователь КАК Страхователь,
	|	Требования.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТТребования
	|ИЗ
	|	&Требования КАК Требования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Требования.Страхователь КАК Страхователь,
	|	Требования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизическиеЛица.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ИСТИНА КАК Использование,
	|	ЛОЖЬ КАК ПоказыватьРезультат,
	|	0 КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА Согласия.ДатаОтзываСогласия ЕСТЬ NULL
	|				ИЛИ Согласия.ДатаОтзываСогласия = &МаксимальнаяДата
	|			ТОГДА &ПустаяДата
	|		ИНАЧЕ Согласия.ДатаОтзываСогласия
	|	КОНЕЦ КАК ДатаОтзываСогласия,
	|	ВЫБОР
	|		КОГДА Согласия.Подписано
	|			ТОГДА Согласия.Согласие
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СогласиеНаУведомлениеОбЭЛН.ПустаяСсылка)
	|	КОНЕЦ КАК Согласие,
	|	Согласия.Состояние КАК Состояние,
	|	Согласия.ОснованиеОтзываСогласия КАК ОснованиеОтзываСогласия
	|ИЗ
	|	ВТТребования КАК Требования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Требования.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласияНаУведомленияОбЭЛН КАК Согласия
	|		ПО Требования.ФизическоеЛицо = Согласия.ФизическоеЛицо
	|			И Требования.Страхователь = Согласия.Страхователь";
	
	Запрос.УстановитьПараметр("Требования", Требования);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("МаксимальнаяДата", НачалоДня(ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата()));
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Список.Загрузить(ТаблицаЗначений);
	Для Каждого ЭлементСписка Из Список Цикл
		Если Не РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(
				ЭлементСписка.СтраховойНомерПФР,
				ЭлементСписка.Кратко) Тогда
			ЭлементСписка.Использование = Ложь;
			ЭлементСписка.ПоказыватьРезультат = Истина;
			ЭлементСписка.ИндексКартинки = 5;
		ИначеЕсли Параметры.ВключитьПодписку
			И ЭлементСписка.Состояние <> Перечисления.СостоянияСогласийНаУведомленияОбЭЛН.Подписано Тогда
			Если ЗначениеЗаполнено(ЭлементСписка.Состояние) Тогда
				ЭлементСписка.Кратко = СтрШаблон(НСтр("ru = 'Согласие %1'"), НРег(Строка(ЭлементСписка.Состояние)));
			Иначе
				ЭлементСписка.Кратко = НСтр("ru = 'Не оформлено согласие сотрудника на уведомление об ЭЛН'");
			КонецЕсли;
			ЭлементСписка.Подробно = "{ОткрытьСогласие}";
			ЭлементСписка.Использование = Ложь;
			ЭлементСписка.ПоказыватьРезультат = Истина;
			ЭлементСписка.ИндексКартинки = 5;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗначений.Свернуть("Страхователь");
	Страхователи = ТаблицаЗначений.ВыгрузитьКолонку("Страхователь");
	Если Страхователи.Количество() = 1 Тогда
		Элементы.Страхователь.Видимость = Истина;
		Элементы.СписокСтрахователь.Видимость = Ложь;
		Страхователь = Страхователи[0];
	Иначе
		Элементы.Страхователь.Видимость = Ложь;
		Элементы.СписокСтрахователь.Видимость = Истина;
	КонецЕсли;
	
	Если Элементы.Подтверждаю.Видимость Тогда
		Если Список.Количество() <= 1 Тогда
			Элементы.Подтверждаю.Заголовок = 
				НСтр("ru = 'Подтверждаю получение согласия от сотрудника на получение оповещения.
					|Обязуюсь в течении одного рабочего для с момента увольнения сотрудника отключить подписку по нему.
					|Принимаю условия об отключении от сервиса в случае выявления нарушений.'");
		Иначе
			Элементы.Подтверждаю.Заголовок = 
				НСтр("ru = 'Подтверждаю получение согласия от сотрудников на получение оповещения.
					|Обязуюсь в течении одного рабочего для с момента увольнения сотрудника отключить подписку по нему.
					|Принимаю условия об отключении от сервиса в случае выявления нарушений.'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправкиЗапросовВФСС(РезультатыОтправкиЗапросов, Контекст) Экспорт
	ПослеОтправкиЗапросовВФССНаСервере(РезультатыОтправкиЗапросов, Контекст);
	Если РезультатыОтправкиЗапросов.БылиОшибки Тогда
		ИнформированиеПользователяКлиент.ПоказатьПодробности(
			СтрСоединить(РезультатыОтправкиЗапросов.Ошибки, Символы.ПС + Символы.ПС),
			НСтр("ru = 'Информация об ошибках'"),
			БиблиотекаКартинок.Предупреждение32);
	Иначе
		СЭДОФССКлиент.ПолучитьСообщенияИзФСС(Контекст.Организации);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеОтправкиЗапросовВФССНаСервере(Знач РезультатыОтправкиЗапросов, Контекст)
	Если Параметры.ВключитьПодписку Тогда
		ТекстЖурнала = НСтр("ru = 'Результат отправки запрос в ФСС от имени организации %1 на включение подписки на уведомления об ЭЛН:'");
	Иначе
		ТекстЖурнала = НСтр("ru = 'Результат отправки запрос в ФСС от имени организации %1 на отключение подписки на уведомления об ЭЛН:'");
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из РезультатыОтправкиЗапросов.РезультатыОперации Цикл
		Страхователь = КлючИЗначение.Ключ;
		РезультатСвязиСФСС = КлючИЗначение.Значение;
		
		ШаблонЗаполнения = Новый Структура("Успех, Использование, Кратко, Подробно, ИндексКартинки");
		ШаблонЗаполнения.Успех = РезультатСвязиСФСС.Выполнено;
		ШаблонЗаполнения.Использование = Не ШаблонЗаполнения.Успех;
		ШаблонЗаполнения.Подробно = СокрЛП(РезультатСвязиСФСС.ОписаниеОшибки);
		ШаблонЗаполнения.Кратко = СтрПолучитьСтроку(ШаблонЗаполнения.Подробно, СтрЧислоСтрок(ШаблонЗаполнения.Подробно));
		Если ШаблонЗаполнения.Успех Тогда
			Если Параметры.ВключитьПодписку Тогда
				ШаблонЗаполнения.ИндексКартинки = 3;
			Иначе
				ШаблонЗаполнения.ИндексКартинки = 4;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ШаблонЗаполнения.Кратко) Тогда
				ШаблонЗаполнения.Кратко = НСтр("ru = 'Запрос успешно отправлен. Ожидается ответ от ФСС.'");
			КонецЕсли;
			ТекстЖурнала = ТекстЖурнала + ШаблонЗаполнения.Кратко;
		Иначе
			ШаблонЗаполнения.ИндексКартинки = 5;
			ТекстЖурнала = ТекстЖурнала + ШаблонЗаполнения.Подробно;
		КонецЕсли;
		
		ФизическиеЛица = Новый Массив;
		ОтправляемыеСтроки = Список.НайтиСтроки(Новый Структура("Использование, ЗапросОтправлен, Страхователь", Истина, Истина, Страхователь));
		Для Каждого ЭлементСписка Из ОтправляемыеСтроки Цикл
			
			ЗаполнитьЗначенияСвойств(ЭлементСписка, ШаблонЗаполнения);
			
			ФизическиеЛица.Добавить(ЭлементСписка.ФизическоеЛицо);
			
			ЗаписьЖурналаРегистрации(
				СЭДОФССРасширенный.ИмяСобытияЖурнала(),
				УровеньЖурналаРегистрации.Информация,
				Метаданные.Справочники.Сотрудники,
				ЭлементСписка.ФизическоеЛицо,
				СтрШаблон(ТекстЖурнала, ЭлементСписка.Страхователь));
			
		КонецЦикла;
		
		Если РезультатСвязиСФСС.Выполнено Тогда
			РегистрыСведений.ПодпискиНаУведомленияОбЭЛН.ПослеОтправкиЗапросаНаИзменениеПодписки(
				Страхователь,
				ФизическиеЛица,
				ДатаОтправки,
				Параметры.ВключитьПодписку,
				РезультатСвязиСФСС.ИдентификаторЗапроса);
		КонецЕсли;
		
		// Подготовка к отображению результата.
		Если Список.НайтиСтроки(Новый Структура("Использование, ЗапросОтправлен", Истина, Ложь)).Количество() = 0 Тогда
			Элементы.СписокСтраховойНомерПФР.Видимость = Ложь;
			Элементы.СписокСогласие.Видимость = Ложь;
			Элементы.СписокДатаОтзываСогласия.Видимость = Ложь;
			Элементы.СписокОснованиеОтзываСогласия.Видимость = Ложь;
			Элементы.ФормаОтмена.Видимость = Ложь;
			Элементы.ФормаЗакрыть.Видимость = Истина;
			Элементы.ФормаИзменитьПодписку.Видимость = Ложь;
			Элементы.ТаблицаФормыВключитьВсе.Видимость = Ложь;
			Элементы.ТаблицаФормыОтключитьВсе.Видимость = Ложь;
			Элементы.СписокИспользование.Видимость = Ложь;
			Элементы.Подтверждаю.Видимость = Ложь;
			Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура("ЗапросОтправлен", Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеОтветовОтФСС()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.Страхователь КАК Страхователь,
	|	Список.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТСписок
	|ИЗ
	|	&Список КАК Список
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодпискиНаУведомленияОбЭЛН.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодпискиНаУведомленияОбЭЛН.Страхователь КАК Страхователь,
	|	ПодпискиНаУведомленияОбЭЛН.Действует КАК Действует,
	|	ПодпискиНаУведомленияОбЭЛН.ДатаОтправки КАК ДатаОтправки,
	|	ПодпискиНаУведомленияОбЭЛН.ТекстОшибки КАК ТекстОшибки,
	|	ПодпискиНаУведомленияОбЭЛН.БудетДействовать КАК БудетДействовать
	|ИЗ
	|	ВТСписок КАК ВТСписок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодпискиНаУведомленияОбЭЛН КАК ПодпискиНаУведомленияОбЭЛН
	|		ПО ВТСписок.ФизическоеЛицо = ПодпискиНаУведомленияОбЭЛН.ФизическоеЛицо
	|			И ВТСписок.Страхователь = ПодпискиНаУведомленияОбЭЛН.Страхователь";
	Запрос.УстановитьПараметр("Список", Список.Выгрузить(Новый Структура("Успех", Истина), "ФизическоеЛицо, Страхователь"));
	
	ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	Фильтр = Новый Структура("ФизическоеЛицо, Страхователь");
	ДатаОтправкиЗагруженногоСообщения = РегистрыСведений.ПодпискиНаУведомленияОбЭЛН.ДатаОтправкиЗагруженногоСообщения();
	Для Каждого СтрокаРегистра Из ТаблицаРегистра Цикл
		
		Если СтрокаРегистра.ДатаОтправки = ДатаОтправкиЗагруженногоСообщения
			И СтрокаРегистра.Действует = СтрокаРегистра.БудетДействовать Тогда
			Если Параметры.ВключитьПодписку Тогда
				ИндексКартинки = 3;
				Кратко         = НСтр("ru = 'Подписка включена.'");
			Иначе
				ИндексКартинки = 4;
				Кратко         = НСтр("ru = 'Подписка отключена.'");
			КонецЕсли;
			Подробно = "";
		ИначеЕсли ЗначениеЗаполнено(СтрокаРегистра.ТекстОшибки) Тогда
			Подробно       = СтрокаРегистра.ТекстОшибки;
			Кратко         = СтрПолучитьСтроку(Подробно, 1);
			ИндексКартинки = 5;
		Иначе
			Продолжить; // Ответ не получен.
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Фильтр, СтрокаРегистра);
		Найденные = Список.НайтиСтроки(Фильтр);
		Для Каждого ЭлементСписка Из Найденные Цикл
			ЭлементСписка.Кратко         = Кратко;
			ЭлементСписка.Подробно       = Подробно;
			ЭлементСписка.ИндексКартинки = ИндексКартинки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
